app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks"  WHERE "tasks"."user_id" = ?  ORDER BY created_at DESC  [["user_id", 1]]
---
  def index
    @tasks = current_user.tasks.order('created_at DESC')

INSERT INTO "tasks" ("created_at", "name", "state", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-03-04 12:37:30.942224"], ["name", "tarea1"], ["state", "f"], ["updated_at", "2015-03-04 12:37:30.942224"], ["user_id", 1]]
---
  def create
    @task = Task.new(task_params)
    @task.user = current_user
    respond_to do |format|
      if @task.save